In [3]:
import pandas as pd

In [7]:
#lista []
data = [['A',1],['B',2],['C',3]]
print(type(data))

<class 'list'>

In [8]:
df = pd.DataFrame(data,columns =['Letra','orden'])
df

  Letra  orden
0     A      1
1     B      2
2     C      3

In [10]:
#diccionario {}
data = {'Letra':['A','B','C'], 'Orden': [1,2,3]}
print(type(data))

<class 'dict'>

In [11]:
df = pd.DataFrame(data)

In [12]:
df

  Letra  Orden
0     A      1
1     B      2
2     C      3

In [14]:
#lista de tuplas [()]
data = [('A',1),('B',2),('C',3)]
print(type(data))

<class 'list'>

In [17]:
df = pd.DataFrame(data, columns=['Letra','Orden'])
df

  Letra  Orden
0     A      1
1     B      2
2     C      3

In [24]:
df = pd.read_csv('../data/data' , sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [25]:
df = pd.read_csv('../data/data.csv')

In [26]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [28]:
df = pd.read_csv('../data/data_without_header', header=None, names=['Nombre','Edad','Ciudad'])
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [29]:
df = pd.read_json('../data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [30]:
df = pd.read_json('../data/data.json')
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [35]:
df = pd.read_json('../data/data.json')
df.head()

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [36]:
df = pd.read_json('../data/data.json')
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [38]:
df = pd.read_json('../data/data.json')
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [40]:
df = pd.read_json('../data/data.json')
df.shape

(3, 3)

In [49]:
df[['nombre','edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [55]:
df.loc[1]

nombre        María
edad             30
ciudad    Barcelona
Name: 1, dtype: object

In [56]:
df.loc[[0,2]]

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [58]:
df[df['edad'] >25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [59]:
data = {
            'grupo':['A','B','A','B','B'],
            'valor': [12,43,23,11,55]   
        }
df= pd.DataFrame(data)
df

  grupo  valor
0     A     12
1     B     43
2     A     23
3     B     11
4     B     55

In [60]:
df.groupby('grupo').mean()

           valor
grupo
A      17.500000
B      36.333333

In [64]:
df.groupby('grupo').sum()

       valor
grupo
A         35
B        109

In [65]:
import numpy as np

In [66]:
df

  grupo  valor
0     A     12
1     B     43
2     A     23
3     B     11
4     B     55

In [68]:
df['resta'] = df['valor'] - 2
df

  grupo  valor  resta
0     A     12     10
1     B     43     41
2     A     23     21
3     B     11      9
4     B     55     53

In [69]:
def doble(x):
    return x*2

In [71]:
df['dobleValor'] = df['valor'].apply(doble)
df

  grupo  valor  resta  dobleValor
0     A     12     10          24
1     B     43     41          86
2     A     23     21          46
3     B     11      9          22
4     B     55     53         110